using System;

/*
Создать решение с именем HW_1 и проектом консольного приложения Task01. 
В Task01 осуществить вывод на экран строки “Hello, World!”
*/

class Program
{
    static void Main()
    {
        Console.WriteLine("Hello, world!");
        Console.ReadKey();
    }
}
