using System;

/*
Написать метод для решения квадратного уравнения. 
Параметры – коэффициенты уравнения А, В, С, и два параметра, для получения значений вещественных корней. 

При отсутствии вещественных корней (если А=В=С=0 или А=В=0 и С!=0) метод должен возвращать в точку вызова значение false, иначе - true. 

В основной программе вводить коэффициенты квадратного уравнения, выводить значения вещественных корней или сообщение об их отсутствии.
*/
class Program
{
    static void Main(string[] args)
    {

    }
}

