using System;

/*
4.1. Написать метод для формирования массива, целочисленные неотрицательные элементы которого 
вычисляются по следующему рекуррентному соотношению: ai+1 = ai%2==0 ? ai/2 :(3*ai+1). 
Процесс вычисления завершается, когда ai+1 станет равным 1. 
Параметр метода задает значение a0. Количество элементов массива заранее не известно, так как 
определяется значением a0.
 
4.2. Написать метод вывода элементов массива в виде [индекс] = значение, размещая в строке по 5 элементов.

4.3 В основной программе, вводя значения a0, формировать массив и выводить его элементы на экран.
*/
class Program
{
    static void Main(string[] args)
    {

    }
}

