using System;

/*
8.1. Написать метод формирования массива из N вещественных элементов, значения элементов массива 
вычисляются по формуле:
𝑎_𝑖=(𝑖(𝑖+1))/2  % N;  i = 0, 1, 2, 3, …, (N-1)
8.2. Написать метод нормировки элементов вещественного массива путем деления каждого элемента на 
значение максимального по модулю элемента.
8.3. Написать метод вывода на экран значений элементов вещественного массива с точностью до трёх 
знаков после запятой.
8.4. В основной программе получать от пользователя значение N, формировать и нормировать массив. 
Исходный и нормированный массивы выводить на экран. 
*/
class Program
    {
        static void Main(string[] args)
        {
        }
    }

