using System;

/*
6.1.  Написать метод, реализующий операцию «сжатия массива»: если сумма двух соседних 
элементов A[i], A[i+1] начиная с первого делится на три, вычислить их произведение. 
Произведение присвоить элементу A[i]. Элемент A[i+1] удалить, элементы справа от i сдвигаются 
на одну позицию влево, размер массива уменьшается на 1. Далее обрабатываются элементы, начиная 
с  (i+1)-го и так до конца массива. 
6.2.  Написать метод, последовательно «запускающий» операцию (метод) сжатия массива и возвращающий
количество успешно проведенных операций до момента, когда сжать массив больше невозможно. 
В основной программе ввести размер N целочисленного массива, создать массив, присвоить его 
элементам случайные значения из диапазона [-10;10]. Выполнить сжатие массива.  
*/
class Program
{
    static void Main(string[] args)
    {
    }
}

